// 배열 [] 표기
let 배열 = [1, 2, '값'];

console.log(배열[0]);
console.log(배열[1]);
console.log(배열[2]); 
배열 [2] = 3
console.log(배열[2]); // 3

let 중첩배열 = [['알파', 23], ['베타', 19], ['감마', 22]];
console.log(중첩배열)
console.log(중첩배열[0]); // 알파
console.log(중첩배열[0][0]); // 알파
console.log(중첩배열[0][1]); // 알파
console.log(중첩배열[2][1]); // 베타

//배열에서 맨뒤에 값을 추가하고 싶으면 push
중첩배열.push('델타');
console.log(중첩배열); // ['알파', 23], ['베타', 19], ['감마', 22], '델타'
// 배열의 맨 뒤에 값을 삭제하고 싶으면 pop
중첩배열.pop();
console.log(중첩배열); // ['알파', 23], ['베타', 19], ['감마', 22]